package com.javarush.task.task09.task0921;

import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.util.ArrayList;
import java.util.List;

/* 
Написать программу, которая будет вводить числа с клавиатуры.
Код по чтению чисел с клавиатуры должен быть в методе readData.
Обернуть все тело (код внутри readData) этого метода в try..catch.
Если пользователь ввёл какой-то текст, вместо ввода числа, то метод должен перехватить исключение и вывести на экран все ранее введенные числа в качестве результата.
Числа выводить с новой строки сохраняя порядок ввода.
*/

public class Solution {
    public static void main(String[] args) {
        readData();
    }

    public static void readData() {
        //напишите тут ваш код
        ArrayList<Integer> arrayList = new ArrayList<>();
        BufferedReader buffRead = new BufferedReader(new InputStreamReader(System.in));
        try {
            while (true) {
                int value = Integer.parseInt(buffRead.readLine());
                arrayList.add(value);
            }
        } catch (Exception e) {
            for (Integer num : arrayList) {
                System.out.println(num);
            }
        }
    }
}
